Revit 2024 API
Transform.ScaleBasisAndOrigin Method
Scales the basis vectors and the origin of this transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Transform ScaleBasisAndOrigin(
	double scale
)
Visual Basic
Public Function ScaleBasisAndOrigin ( _
	scale As Double _
) As Transform
Visual C++
public:
Transform^ ScaleBasisAndOrigin(
	double scale
)
Parameters
scale
Type: System.Double
The scale value.
Return Value
The transformation equal to the composition of the two transformations.
Remarks
 The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the specified value is an infinite number.
See Also
Transform Class
Autodesk.Revit.DB Namespace